Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: By default, the value of HTTP_USER_AGENT is used; however, you can alter this (i.e., look up another browser's info) by passing the optional user_agent parameter to get_browser().
es: Por defecto, se utiliza el valor de $HTTP_USER_AGENT; sin embargo, puede alterar ésto (i.e., consultando otra información del navegador) pasando el parámetro opcional user_agent a get_browser().

source: The information is returned in an object, which will contain various data elements representing, for instance, the browser' s major and minor version numbers and ID string; TRUE / FALSE values for features such as frames, JavaScript, and cookies; and so forth.
es: La información se devuelve en un objto, que contendrá varios elementos de datos que representan, por ejemplo, los números de versión (mayor y menor) del navegador y la cadena ID; valores TRUE / false para características como los marcos, JavaScript, y cookies; etc.

source: While browscap.ini contains information on many browsers, it relies on user updates to keep the database current.
es: browscap.ini contiene información de muchos navegadores, depende de las actualizaciones del usuario para mantener la base de datos actualizada.

source: The format of the file is fairly self-explanatory.
es: El formato del fichero es claramente auto-explicativo.

source: The following example shows how one might list all available information retrieved about the user 's browser.
es: El ejemplo siguiente muestra como se puede listar toda la información disponible recuperada del navegador del usuario.

source: Example 1. get_browser() example
es: Ejemplo 1. ejemplo get_browser()

source: ?php echo $_SERVER[ 'HTTP_USER_AGENT']. "hr / \n"; $browser = get_browser(); foreach ($browser as $name = $value) {print" b $name / b $value br / \n";}?
es: ?php function list_array( $array) {while (list ($key, $value) = each ($array)) {$str .= "b $key: / b $value br \n";} return $str;} echo "$HTTP_USER_AGENT hr \n"; $browser = get_browser(); echo list_array ((array) $browser);?

source: The output of the above script would look something like this:
es: La salida del script anterior debería paracerse a ésto:

source: Mozilla / 4.5 [en] (X11; U; Linux 2.2.9 i586) hr / b browser_name_pattern: / b Mozilla / 4\.5.* br / b parent: / b Netscape 4.0 br / b platform: / b Linux br / b majorver: / b 4 br / b minorver: / b 5 br / b browser: / b Netscape br / b version: / b 4 br / b frames: / b 1 br / b tables: / b 1 br / b cookies: / b 1 br / b backgroundsounds: / b br / b vbscript: / b br / b javascript: / b 1 br / b javaapplets: / b 1 br / b activexcontrols: / b br / b beta: / b br / b crawler: / b br / b authenticodeupdate: / b br / b msn: / b br /
es: Mozilla / 4.5 [en] (X11; U; Linux 2.2.9 i586) hr b browser_name_pattern: / b Mozilla / 4\.5.* br b parent: / b Netscape 4.0 br b platform: / b Unknown br b majorver: / b 4 br b minorver: / b 5 br b browser: / b Netscape br b version: / b 4 br b frames: / b 1 br b tables: / b 1 br b cookies: / b 1 br b backgroundsounds: / b br b vbscript: / b br b javascript: / b 1 br b javaapplets: / b 1 br b activexcontrols: / b br b beta: / b br b crawler: / b br b authenticodeupdate: / b br b msn: / b br

source: By default, the browscap directive is commented out.
es: Para conseguir ésto, su opción de fichero de configuración browscap debe apuntar a la correcta localización del fichero browscap.ini.

source: The only way to test if cookies are accepted is to set one with setcookie(), reload, and check for the value.
es: Para más información (incluyendo localizaciones desde las que puede obtener un fichero browscap.ini), consulte las FAQ sobre PHP en http: / /www.php.net / FAQ.html.

source: In this case, you will pass in $HTTP_SERVER_VARS[ 'HTTP_USER_AGENT'].
es: Nota: el soporte para browscap fue añadido en la versión 3.0b2 de PHP.

source: Returns the current value of the PHP configuration variable specified by varname, or FALSE if an error occurs.
es: Devuelve el valor actual de una variable de configuración de PHP especificada en varname, o FALSE si ocurre un error.

source: It will not return configuration information set when the PHP was compiled, or read from an Apache configuration file (using the php3_configuration_option directives).
es: No devolverá información de la configuracion cuando el PHP fue compilado, o leído desde un fichero de configuración Apache (utilizando las directivas php3_configuration_option directives).

source: To check whether the system is using a configuration file, try retrieving the value of the cfg_file_path configuration setting.
es: Para comprobar si el sistema está utilizando un fichero de configuración, intente recuperar el valor de cfg_file_path.

source: See also ini_get().
es: Si está disponible, se está utilizando un fichero de configuración.

source: This function returns an array of method names defined for the class specified by class_name.
es: Esta función devuelve un vector con los nombres de los métodos definidos en la clase especificada como class_name.

source: As of PHP 4.0.6, you can specify the object itself instead of class_name.
es: A partir de PHP 4.0.6, se puede especificar el objeto a sí mismo en vez de class_name.

source: Example 1. get_class_methods() example
es: Ejemplo 1. get_class_methods() ejemplo

source: Will produce:
es: Producira:

source: See also get_class_vars() and get_object_vars().
es: Ver también get_class_vars() y get_object_vars().

source: This function will return an associative array of default properties of the class.
es: Esta función devuelve un vector con las propiedades que han sido inicializadas por defecto en la clase.

source: The resulting array elements are in the form of varname = value.
es: Los elementos de este vector están estan organizados de la forma varname = value.

source: Prior to PHP 4.2.0, Uninitialized class variables will not be reported by get_class_vars().
es: Las variables de la clase que no estén inicializadas, no será presentadas por get_class_vars().

source: Example 1. get_class_vars() example
es: Ejemplo 1. get_class_vars() ejemplo

source: / / Before PHP 4.2.0 var2: xyz var3:
es: var2: xyz var3:

source: See also get_class_methods(), get_object_vars()
es: Ver también get_class_methods(), get_object_vars()

source: Returns the name of the owner of the current PHP script.
es: Devuelve el nombre del propietario del script PHP actual.

source: See also getmyuid(), getmygid(), getmypid(), getmyinode(), and getlastmod().
es: Véase también getmyuid(), getmypid(), getmyinode(), y getlastmod().

source: Returns an associative array containing the date information of the timestamp, or the current local time if no timestamp is given, as the following array elements:
es: Devuelve un array asociativo que contiene la información de fecha del valor timestamp como los siguientes elementos:

source: "seconds" - seconds
es: "seconds" - segundos

source: "minutes" - minutes
es: "minutes" - minutos

source: "hours" - hours
es: "hours" - horas

source: "mday" - day of the month
es: "mday" - día del mes

source: "wday" - day of the week, numeric: from 0 as Sunday up to 6 as Saturday
es: "wday" - día de la semana, en número

source: "year" - year, numeric
es: "mon" - mes, en número

source: "yday" - day of the year, numeric; i.e. "299 "
es: "year" - año, en número

source: "weekday" - day of the week, textual, full; i.e. "Friday "
es: "yday" - día del año, en número; por ejemplo, "299 "

source: Example 1. getdate() example
es: "weekday" - día de la semana, en texto, completo; por ejemplo, "Friday "

source: $today = getdate(); $month = $today['month']; $mday = $today['mday']; $year = $today['year']; echo "$month $mday, $year";
es: "month" - mes, en texto, completo; por ejemplo, "January "

source: $ip = getenv ("REMOTE_ADDR"); / / get the ip number of the user
es: Devuelve el valor de la variable de entorno varname, o FALSE en caso de error.

source: You can see a list of all the environmental variables by using phpinfo().
es: $ip = getenv( "REMOTE_ADDR"); / / get the ip number of the user

source: See also putenv().
es: Puede encontrar el significado de la mayoría echando un vistazo en CGI specification (especificación CGI), especialmente en page on environmental variables (página de variables de entorno).

source: Returns the host name of the Internet host specified by ip_address or a string containing the unmodified ip_address on failure.
es: Si ocurre un error, devuelve ip_address.

source: See also gethostbyname().
es: Ver también gethostbyname().

source: Returns the IP address of the Internet host specified by hostname or a string containing the unmodified hostname on failure.
es: Devuelve la dirección IP de una máquina conectada a Internet especificada por hostname.

source: See also gethostbyaddr().
es: Ver también gethostbyaddr().

source: Returns a list of IP addresses to which the Internet host specified by hostname resolves.
es: Devuleve una lista de direcciones IP pertenecientes a ordenadores especificados por hostname.

source: See also gethostbyname(), gethostbyaddr(), checkdnsrr(), getmxrr(), and the named(8) manual page.
es: Ver también gethostbyname(), gethostbyaddr(), checkdnsrr(), getmxrr(), y named(8) en las páginas del manual.

source: get_html_translation_table() will return the translation table that is used internally for htmlspecialchars() and htmlentities().
es: get_html_translation_table() devolverá la tabla de traducción que se usa internamente para htmlspecialchars() y htmlentities().

source: And as in the htmlspecialchars() and htmlentities() functions you can optionally specify the quote_style you are working with.
es: Ejemplo 1.

source: The default is ENT_COMPAT mode.
es: Ejemplo de Tabla de Traducción

source: $trans = get_html_translation_table( HTML_ENTITIES); $str = "Hallo Frau Krämer"; $encoded = strtr($str, $trans);
es: Lo interesante es usar la función array_flip() para cambiar la dirección de la traducción.

source: The cool thing is using array_flip() to change the direction of the translation.
es: $trad = array_flip ($trad); $original = strtr ($cad, $trad);

source: $trans = array_flip( $trans); $original = strtr($encoded, $trans);
es: Esta función fue añadida en PHP 4.0.

source: See also htmlspecialchars(), htmlentities(), strtr(), and array_flip().
es: Vea también: htmlspecialchars(), htmlentities(), strtr(), y array_flip().

source: Returns an array with 4 elements.
es: La función GetImageSize() determinará el tamaño de cualquier fichero de imagen GIF, JPG o PNG y devolverá sus dimensiones junto al tipo de fichero en una cadena de texto que pueda ser usada en una marca HTML IMG normal.

source: Index 1 contains the height.
es: Devuelve una matriz con 4 elementos.

source: 1 = GIF, 2 = JPG, 3 = PNG, 4 = SWF, 5 = PSD, 6 = BMP, 7 = TIFF( intel byte order), 8 = TIFF(motorola byte order), 9 = JPC, 10 = JP2, 11 = JPX, 12 = JB2, 13 = SWC, 14 = IFF.
es: El índice 0 contiene la anchura de la imagen en pixels.

source: These values correspond to the IMAGETYPE constants that were added in PHP 4.3.
es: El índice 1 contiene la altura.

source: Example 1. getimagesize (file)
es: El índice 2 es una marca indicando el tipo de imagen.

source: Example 2. getimagesize (URL)
es: 1 = GIF, 2 = JPG, 3 = PNG.

source: With JPG images, two extra indexes are returned: channels and bits. channels will be 3 for RGB pictures and 4 for CMYK pictures. bits is the number of bits for each color.
es: El índice 3 es una cadena de texto con el string correcto "height=xxx width=xxx" para ser usado directamente en una marca IMG.

source: Beginning with PHP 4.3, bits and channels are present for other image types, too.
es: Ejemplo 1.

source: However, the presence of these values can be a bit confusing.
es: GetImageSize

source: Some formats may contain no image or may contain multiple images.
es: ?php $size = GetImageSize( "img / flag.jpg");?

source: In these cases, getimagesize() might not be able to properly determine the image size. getimagesize() will return zero for width and height in these cases.
es: IMG SRC=" img / flag.jpg "?php echo $size[3];?

source: This information can be used to deliver images with correct HTTP Content-type headers:
es: El parámetro opcional imageinfo permite extraer información adicional del fichero de imagen.

source: ?php $size = getimagesize ($filename); $fp=fopen($filename, "rb"); if ($size $fp) {header("Content-type: {$size['mime']}"); fpassthru($fp); exit;} else {/ / error}?
es: Actualmente esto devolverá las diferentes marcas APP de los JPG en una matriz asociada.

source: If accessing the filename image is impossible, or if it isn' t a valid picture, getimagesize() will return FALSE and generate a warning.
es: Algunos programas usan estas marcas APP para incluir información textual en las imagenes.

source: Currently, this will return the different JPG APP markers as an associative array.
es: Uno bastante común incluye información IPTC http: / /www.iptc.org / en la marca APP13.

source: A very common one is to embed IPTC http: / /www.iptc.org / A very common one is to embed IPTC http: / /www.iptc.org / information in the APP13 marker.
es: Puede usar la función iptcparse() para convertir la marca binaria APP13 en algo leible.

source: You can use the iptcparse() function to parse the binary APP13 marker into something readable.
es: Ejemplo 2.

source: Example 4. getimagesize() returning IPTC
es: GetImageSize devolviendo IPTC

source: This function does not require the GD image library.
es: Nota:

source: URL support was added in PHP 4.0.5.
es: Esta función no requiere la libreria de imagenes GD.

source: Example 1. get_included_files() Example
es: Ejemplo 1. get_included_files() Example

source: Returns the time of the last modification of the current page.
es: Devuelve la fecha / hora de la última modificación de la página actual.

source: Example 1. getlastmod() example
es: Devuelve FALSE en caso de error.

source: ?php / / outputs e.g. 'Last modified:
es: Ejemplo 1. ejemplo getlastmod()

source: March 04 1998 20:43:59 .' echo "Last modified: ". date ("F d Y H:i:s .", getlastmod());?
es: / / outputs e.g. 'Last modified:

source: If you' re interested in getting the last modification time of a different file, consider using filemtime().
es: March 04 1998 20:43:59 .' echo "Last modified: ".date ("F d Y H:i:s .", getlastmod());

source: See also date(), getmyuid(), getmygid(), get_current_user(), getmyinode(), getmypid(), and filemtime().
es: Véase también date(), getmyuid(), get_current_user(), getmyinode(), y getmypid().

source: So even when get_magic_quotes() returns TRUE neither double quotes, backslashes or NUL's will be escaped.
es: Devuelve el valor de la configuración activa actual de magic_quotes_gpc. (0 desactivado, 1 activado)

source: See also addslashes(), stripslashes(), get_magic_quotes_runtime(), and ini_get().
es: Véase también get_magic_quotes_runtime(), set_magic_quotes_runtime().

source: Returns the current active configuration setting of magic_quotes_runtime (0 for off, 1 for on).
es: Devuelve el valor de la configuración activa actual de magic_quotes_runtime. (0 desactivado, 1 activado)

source: See also get_magic_quotes_gpc() and set_magic_quotes_runtime().
es: Véase también get_magic_quotes_gpc(), set_magic_quotes_runtime().

source: Setting use_include_path to 1 will result in PHP trying to open the file along the standard include path as per the include_path directive.
es: Setting use_include_path to 1 will result in PHP trying to open the file along the standard include path as per the include_path Setting use_include_path to 1 will result in PHP trying to open the file along the standard include path as per the include_path directive.

source: Searches DNS for MX records corresponding to hostname.
es: Busca DNS de registros MX correspondientes a hostname.

source: A list of the MX records found is placed into the array mxhosts.
es: Devuelve verdadero si encuentra alg£n registro; devuelve falso si no encuentra ninguno o se produce un error.

source: If the weight array is given, it will be filled with the weight information gathered.
es: La lista de registros MX encontrados se colocan en el array mxhosts.

source: See also checkdnsrr(), gethostbyname(), gethostbynamel(), gethostbyaddr(), and the named(8) manual page.
es: Ver también checkdnsrr(), gethostbyname(), gethostbynamel(), gethostbyaddr(), y named(8) de las páginas del manual.

source: See also getmygid(), getmyuid(), get_current_user(), getmypid(), and getlastmod().
es: Devuelve el inodo del script actual, o FALSE en caso de error.

source: Returns the current PHP process ID, or FALSE on error.
es: Devuelve el ID del proceso PHP actual, o FALSE en caso de error.

source: We recommend against relying on pids in security-dependent contexts.
es: Advierta que cuando se ejecuta como un módulo de servidor, diferentes llamadas del script no garantizan que tengan distintos pids.

source: See also getmygid(), getmyuid(), get_current_user(), getmyinode(), and getlastmod().
es: Véase también getmyuid(), get_current_user(), getmyinode(), y getlastmod().

source: Returns the user ID of the current script, or FALSE on error.
es: Devuelve el ID de usuario del script actual, o FALSE en caso de error.

source: See also getmygid(), getmypid(), get_current_user(), getmyinode(), and getlastmod().
es: Véase también getmypid(), get_current_user(), getmyinode(), y getlastmod().

source: In versions after PHP 4.2.0, the key will be assigned with a NULL value.
es: Las variables declaradas en la clase a la que pertenece obj, que no les ha sido asignado un valor, no serán devueltas en el vector.

source: Use of get_object_vars()
es: Uso de get_object_vars()

source: Array ([x] = 1.233 [y] = 3.445 [label] =) Array ([x] = 1.233 [y] = 3.445 [label] = point #1)
es: Array ([x] = 1.233 [y] = 3.445) Array ([x] = 1.233 [y] = 3.445 [label] = point #1)

source: See also get_class_methods() and get_class_vars()!
es: Ver tambien get_class_methods() y get_class_vars()!

source: getprotobyname() returns the protocol number associated with the protocol name as per / etc / protocols.
es: getprotobyname() devuelve el n£mero asociado al nombre del protocolo name del fichero / etc / protocols.

source: See also: getprotobynumber().
es: Ver también getprotobynumber().

source: getprotobynumber() returns the protocol name associated with protocol number as per / etc / protocols.
es: getprotobynumber() devuelve el nombre del protocolo asociado al number del protocolo en el fichero / etc / protocols.

source: See also: getprotobyname().
es: Ver también getprotobyname().

source: Returns the maximum value that can be returned by a call to rand().
es: Devuelve el valor máximo que puede devolver una llamada a rand().

source: See also rand(), srand() and mt_getrandmax().
es: Vea también rand(), srand() mt_rand(), mt_srand() y mt_getrandmax().

source: This is an interface to getrusage( 2).
es: Es un interface a getrusage( 2).

source: It returns an associative array containing the data returned from the system call.
es: Devuelve un array asociativo que contiene los datos devueltos de la llamada del sistema.

source: If who is 1, getrusage will be called with RUSAGE_CHILDREN.
es: Si who (quien) es 1, getrusage debería llamarse con RUSAGE_CHILDREN.

source: All entries are accessible by using their documented field names.
es: Todas las entradas son accesibles utilizando sus nombres de campo documentados.

source: Getrusage Example
es: Ejemplo Getrusage

source: getservbyname() returns the Internet port which corresponds to service for the specified protocol as per / etc / services. protocol is either "tcp "or "udp" (in lowercase).
es: getservbyname() devuelve el puerto que corresponde al service especificado por el protocol en / etc / services. protocol puede ser tcp o udp.

source: See also: getservbyport().
es: Ver también getservbyport().

source: getservbyport() returns the Internet service associated with port for the specified protocol as per / etc / services. protocol is either "tcp "or "udp" (in lowercase).
es: getservbyport() delvuelve el servicio Internet asociado al port para el protocol especificado en / etc / services. protocol puede ser tcp o udp.

source: See also: getservbyname().
es: Ver también getservbyname().

source: This function returns a translated string if one is found in the translation table, or the submitted message if not found.
es: Esta función devuelve la traducción de la cadena si encuentra una en la tabla de traducciones, o el mensaje enviado si no se encuentra ninguna.

source: You may use the underscore character '_' as an alias to this function.
es: Puede usar un carácter de subrayado como un alias para esta función.

source: Example 1. gettext() -check
es: Ejemplo 1. gettext() -check

source: ?php / / Set language to German setlocale( LC_ALL, 'de'); / / Specify location of translation tables bindtextdomain("myPHPApp", ". / locale"); / / Choose domain textdomain("myPHPApp"); / / Print a test message print gettext("Welcome to My PHP Application"); / / Or use the alias _() for gettext() print _("Have a nice day");?
es: ?php / / Establece el idioma en alemán putenv ("LANG=de"); / / Especifica la localización de las tablas de traducción bindtextdomain ("myPHPApp", ". / locale"); / / Elige un dominio textdomain ("myPHPApp"); / / Imprime un mensaje de prueba print (gettext ("Welcome to My PHP Application"));?

source: This is an interface to gettimeofday( 2).
es: Es un interfaz para gettimeofday( 2).

source: "sec" - seconds
es: "sec" - segundos

source: "usec" - microseconds
es: "usec" - microsegundos

source: "minuteswest" - minutes west of Greenwich
es: "minuteswest" - minutos al oeste de Greenwich

source: "dsttime" - type of dst correction
es: "dsttime" - tipo de corrección dst

source: Never use gettype() to test for a certain type, since the returned string may be subject to change in a future version.
es: Devuelve el tipo de la variable PHP var.

source: Instead, use the is_* functions.
es: Los valores posibles de la cadena devuelta son:

source: "double" (for historical reasons "double "is returned in case of a float, and not simply "float")
es: "double"

source: See also settype(), is_array(), is_bool(), is_float(), is_integer(), is_null(), is_numeric(), is_object(), is_resource(), is_scalar(), and is_string().
es: Ver también settype().

source: Identical to the date() function except that the time returned is Greenwich Mean Time (GMT).
es: Idéntica a la función data() Idéntica a la función data() excepto en que la hora devuelta es la de Greenwich (GMT).

source: For example, when run in Finland (GMT +0200), the first line below prints "Jan 01 1998 00:00:00", while the second prints "Dec 31 1997 22:00:00 ".
es: Por ejemplo, si se utiliza en Finlandia (GMT +0200), la primera línea del ejemplo devuelve "Jan 01 1998 00:00:00", mientras la segunda imprime "Dec 31 1997 22:00:00 ".

source: Example 1. gmdate() example
es: Ejemplo de gmdate()

source: See also date(), mktime(), gmmktime() and strftime().
es: Ver también date(), mktime() y gmmktime().

source: Identical to mktime() except the passed parameters represents a GMT date.
es: Idéntica a mktime(), excepto en que los parámetros representan una fecha GMT.

source: The result will be a GMP number representing the sum of the arguments.
es: The result will be GMP number representing the sum of the arguments.

source: Returns a positive value if a b, zero if a = b and negative value if a b.
es: Returns positive value if a b, zero if a = b and negative value if a b.

source: Calculates g, s, and t, such that a*s + b*t = g = gcd( a,b), where gcd is the greatest common divisor.
es: Calculates g, s, and t, such that a*s + b*t = g = gcd( a,b), where gcd is gretest common divisor.
